import random
def random_movie():
  list = ["interstellar","inseption","შერეკილ"]
  list_of_random_movies = ["მე ბებია  ილიკო და ილარიონი","ცისფერი მთები", "მამლუქი","ბაშიაჩუკი", "წუნა და წრუწუნა","ჩხიკვთა ქორწილი"]
  for i in range(4):
    random_item = random.choice(list_of_random_movies)
    list.append(random_item)
    list_of_random_movies.remove(random_item)
    return list
print(random_movie())
# import random ეს არის ბიბლიოთეკა როელშიც ინახება ისეთი კოდები რომლებიც პითონმაც არ იცის
# def random_movie(): ეს არის შექმნილი ფუნქცია რომელიც დაგვეხმარება რომ შემთხვევითობის პრინციპიტ ავირჩიოთ ფილმი
# list = ["interstellar","inseption","შერეკილ"] ეს არის ლისტი რომელშიც არის შეტანილი ფილმების სახელები
# list_of_random_movies = ["მე ბებია  ილიკო და ილარიონი","ცისფერი მთები", "მამლუქი","ბაშიაჩუკი", "წუნა და წრუწუნა","ჩხიკვთა ქორწილი"] ეს არის ლისტი რომლიდანაც შემთხვევითობის პრინციპით ამოირჩევა ფილმი და დამატდება ლისტში
# for i in range(4): ის გამოყენებით ლისტიდან ამოირჩევა რომელიმე ფილმი რომელიც დამატდება მეორე ლისტში
# random_item = random.choice(list_of_random_movies) ეს კოდი ამოირჩევს ერთ ერთ ფილმს 
    # list.append(random_item) ამ კოდის გამოყენებით ის ფილმი ჩაემატება ფილმების ლისტში
    # list_of_random_movies.remove(random_item) ამ კოდის გამოყენებით  ერთი და იგივე ფილმი რომელიც ორჯერ ჩაემატება ერთ ერთი წაიშლება
    # return list ამ კოდის გამოყენებით იგი დაგვიბრუნებს ლისტს რომელშიც იქნება ახალი ფილმები ჩამატებული
# print(random_movie()) ეს კოდი დაგვიპრინტავს ჩამატებულ ფილმებს და ფილმებს რომლებიც უკვე ლისტში იყო

# 3)
#  შექმენით ფუნქცია
# სადაც იქნება ცარიელი სტრინგი
# და for loop ის გამოყენებით
# თქვენი სახელი რენდომულად დაამატეთ
# ამ ცარიელ სტრინგს <3
import random
def random_name():
  empty_string = ""
  my_name = "g u g a"
  my_name_split=my_name.split() # ["g", "u","g","a"]
  for char in  my_name_split:
    random_char = random.choice(my_name_split)
    empty_string += random_char
    my_name_split.remove(random_char)
  return empty_string
print(random_name())
# import random არის ბიბლიოთეკა რომელშიც ინახება ისეთი კოდები რომლებიც თავად პითონმა არ იცის
# def random_name(): ეს არის შექმნილი ფუნქცია რომელიც გვეხმარება რომ გამოგვატანინოს ჩვენი სახელი შემთხვევითობის პრინციპით
# empty_string = "" ეს არის ცარიელი სტრინგი რომელშიც არაფერი არ წერია და გვეხმარება იმაში რომ გამოგვატანინოს ჩვენი სახელიდან რომელიმა ასო
#   my_name = "g u g a" ეს არის ცვლადი რომელშიც წერია ჩემი სახელი რომელიც დაიხლიცება split ის გამოყენებით
# my_name_split=my_name.split() # ["g", "u","g","a"] ეს კოდი გვეხმარება იმაში რომ დავხლიჩოთ ჩვენი სახელი კოდის ბლოში კი წერია როგორი გამოვა ჩემი სახელი
# for char in  my_name_split: გვეხმარება იმაში რომ გამოიტანოს ჩვენი სახელის თითოეული დახლეჩილი ასო
#  random_char = random.choice(my_name_split) ეს კოდი გამოიტანს ჩვენი სახელის ასოებს შემთხვევითობის პრინციპით
# empty_string += random_char ეს კოდი გვეხმარება იმაში რომ ცარიელ სტრინგში დაემატოს რომელიმე ასო
#  my_name_split.remove(random_char) ეს კოდი დაგვეხმარება იმაში რომ გამოიტანოს რომელიმე ასო მაგრამ თუ ერთი ასო გამოვა 2 ჯერ ერთ ერთი წაიშლება
#  return empty_string ეს კოდი გვეხმარება იმაში რომ დაგვიბრუნოს ცარიელი სტრინგი რომელშიც იქნება შეტანილი ჩვენი სახელის რამდენიმე ასო
# print(random_name()) ეს კოდი დაგვიპრინტავს ჩვენი სახელის ასოებს შემთხვევითობის პრინციპით

















