# 1) შექემენით ფუცნია სადაც იქენბა სია ცხვოლებეზე და random.choces() გამოყენებით დაამატეთ ახალ საიში რენდომ ცოხველები
# 2) შექმმენით ფუცნია სადაც იქენბა სია თქვნს საყავრელ ფილმებზე და random.choces() გამოყენებით დაამტეთ 4 რემდონ ფილმი
# 3) შექმენით ფუცნია სადაც იქენბა ცარიელი სტრინგი და for loop ის გამოყენებით თქვნი სახლი რენდომულად დაამატეთ ამ საიში <3 
# 4) შექემნით ფუცნია სადაც იქენბა სია სადაც იქნება 4 სხვადასსხვა სახის ხილი თე ამ ხილდიან რომელიმე /random იენქბა თქვნი საყვარელი ხილი დაპრინეთე
# 5) შექმენით ფუნცია სადაც მომხარებელს შეეკითხებით 4 ჯერ თავის საყვარელი სახის ცხოველს ესენი მოათავსეთ  მასივში ანუ /სიაში/list და ამ სიაში რენოდუმალდ გამოიტანეთ ეს ელემენტები
# 4

import random

def random_fruit():
    fruits = ["apple", "banana", "cherry", "orange"]
    favorite_fruit = random.choice(fruits)
    print(f"Your favorite random fruit is: {favorite_fruit}")


random_fruit()